import React from 'react';
import s from './Main.module.css'

function Main(props) {
    return (
        <div>
            <h1 className={s.welcome}>Добро пожаловать на сайт айыл окмоту Жети-Огузского айылного аймака.</h1>
            <p>Жети-Огузский сельский округ - это живописная административно-территориальная единица, в Кыргызстане. Он представляет собой отдаленный район с насыщенным природным богатством и уникальными ландшафтами.</p>
            <p>Сельский округ окружен горами, предоставляя впечатляющие виды на величественные вершины и живописные долины. Здесь туристы и путешественники могут наслаждаться свежим горным воздухом и красотой окружающей природы.</p>
            <p>Традиции и культура местных жителей тесно связаны с природой. Они сохраняют уникальные национальные обычаи и ремесла, передавая их из поколения в поколение.</p>
            <p>Сельский округ также привлекает внимание туристов, предоставляя возможность для пеших и верховых прогулок, альпинизма, рыбной ловли и других активных видов отдыха.</p>
            <p>Посетители могут исследовать прекрасные природные парки, величественные водопады и знаменитую местную достопримечательность - группу горных вершин, известных как Жети-Огуз («семь баранов»).</p>
            <p>Сельский округ, вероятно, предоставляет простую и уютную инфраструктуру для туристов, включая небольшие отели или гостевые дома, где гости могут наслаждаться гостеприимством местных жителей и национальной кухней.</p>
            <p>Благодаря своей природной красоте и уникальным культурным аспектам, Жети-Огузский сельский округ становится привлекательным направлением для тех, кто стремится познакомиться с кыргызской культурой и насладиться уединенным отдыхом в обрамлении величественных горных пейзажей.</p>
        </div>
    );
}

export default Main;